esp-cpp/espp/components/ethernet/example/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"

# Ethernet (internal EMAC + RMII)
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y

CONFIG_FREERTOS_HZ=1000
